Repository: collective/collective.solr
Catalog: src/collective/solr/locales/*/LC_MESSAGES/solr.po
Languages: de

source: Remove this search limit...
de: Sucheinschränkung entfernen ...

source: description_solr_timeout
de: Bei der Anfrage des Suchservers ist es zu einer Zeitüberschreitung gekommen. Es konnten keine Resultate gefunden werden.

source: description_solr_unknown error
de: Unbekannter Fehler beim Zugriff auf den Suchserver.

source: description_solr_unknown_error_hint
de: Bitte kontaktieren Sie Ihren Systemadministrator

source: description_solr_unreachable
de: Der Suchserver ist zur Zeit nicht erreichbar. Es konnten keine Resultate gefunden werden.

source: description_solr_unreachable_hint
de: Bitte probieren Sie es später noch einmal oder kontaktieren Sie Ihren Systemadministrator.

source: heading_search_facets
de: Suche einschränken...

source: heading_solr_error
de: Suchserver Fehler

source: help_active
de: Auswählen, um die Solr Integration für das Indizieren und die Volltextsuche zu aktivieren.

source: help_async
de: Auswählen, um die asychrone Indizierung zu aktivieren. Ist die Option aktiv wird die Antwortzeit von PLone beim Indizieren verbessert, allerding der Solr Index nicht sofort aktualisiert.

source: help_auto_commit
de: Wenn diese Option aktiviert ist, wird jede Solr Operation mit einem Commit abgeschlossen und der Index wird sofort aktualisiert. Wird diese Option deaktivert, kann das zu einem starken Performancegewinn kommen. Es muss jedoch sichergestellt sein, dass auch beim Solr Server eine commit Policy definiert ist.

source: help_base
de: Die Basis URL für den Zugriff auf den Solr Server. Standardmässig "/solr"

source: help_commit_within
de: Maximales Intervall in Millisekunden bis Solr die Indizierung durchführt. Der Standardwert 0 bedeutet, dass die Indizierung unmittelbar durchgeführt wird. Wird diese Option aktivert, so wird die Option "Automatischer Commit" implizit deaktiviert und eine Konfiguration des Commitintervall Solrseitig ist notwendig.

source: help_effective_steps
de: Zeitintervall in Sekunden. Beim Standardwert von 900 Sekunden (=15 Minuten) werden Änderungen vom Freigabedatum alle 15 Minuten an Solr übermittelt.

source: help_exclude_user
de: Ist diese Option aktiviert, so wird der `user:userid` vom allowedRolesAndUsers Index entfernt. Dadurch lassen sich Solr Anfragen leichert cachen, allerdings ist es aufwändiger Content mit lokalen Rollen zu finden.

source: help_facets
de: Folgende Catalog Indizes werden für das Zusammenstellen der Facetting Information verwendet. Ein Index pro Zeile.

source: help_filter_queries
de: Diese Felder werden für Solr Filteranfragen (fq) verwendet. Eine Zeile entspricht einer Anfrage. Es können pro Zeile mehrere Indizes verwendet werden. Diese werden durch ein Leerzeichen getrennt. Zum Beispiel: effective expires allowedRolesAndUsers oder review_state portal_type.

source: help_host
de: Der Hostname des Solr Servers.

source: help_index_timeout
de: Intervall in Sekunden, bis eine Indizierungsaktion abbricht. Beim Standardwert 0 findet kein Abbruch statt.

source: help_max_results
de: Maximale Anzahl an Resultaten, die von Solr zurückgeliefert werden.

source: help_port
de: Der Port des Solr Servers.

source: help_required
de: Die Suche wird nur dann zum Solr Server weitergegeben, wenn alle gelisteten Felder in der Anfrage vorkommen. Enthält die Query `use_solr=True`, so können die Pflichtfelder übersteuert werden und die Anfrage wird dann in jedem Fall an Solr weitergeleitet.

source: help_search_pattern
de: Bei einfachen Suchanfragen, die nur aus Buchstaben und Zahlen bestehen und keinen erweiterten Solr Anfragesyntax enthalten wird diese Anfrage verwendet, um die Suchanfrage an Solr zu konstruieren. {value} und {base_value} sind als Platzhalter verfügbar und werden durch das Suchwort und das Such.

source: help_search_timeout
de: Intervall in Sekunden, bis eine Suchaktion abbricht. Beim Standardwert 0 findet kein Abbruch statt.

source: help_searchwords
de: Hier können Suchwörter definiert werden. Diese Suchwörter werden bei den Anfragen an Solr stark priorisert. Ein Suchbegriff pro Zeile.

source: help_slow_query_threshold
de: Nach diesem Grenzwert in Millisekunden wird eine Solr Anfrage als langsam gelogged. Bei dem Wert "0" werden langsame Anfragen nicht gelogged.

source: label_active
de: Aktiv

source: label_async
de: Asynchrones Indizieren

source: label_auto_commit
de: Automatische Commits

source: label_base
de: Basis URL

source: label_commit_within
de: Zeitintervall für die Commits zu Solr

source: label_effective_steps
de: Zeitintervall für das Freigabedatum

source: label_exclude_user
de: Den Benutzer vom Feld `allowedRolesAndUsers` ausschliessen.

source: label_facets
de: Standard Facetten

source: label_filter_queries
de: Standard Filter Queries (fq):

source: label_host
de: Host

source: label_index_timeout
de: Zeitüberschreitung beim Indizieren

source: label_levenshtein_distance
de: Levenshtein Distanz

source: label_max_results
de: Maximale Anzahl an Resultaten

source: label_port
de: Port

source: label_required
de: Notwendige Abfrageparameter

source: label_search_pattern
de: Standard Suchmuster für einface Abfragen

source: label_search_timeout
de: Zeitüberschreitung bei der Suche

source: label_searchwords
de: Suchwörter

source: label_showinsearch
de: In den Suchergebnissen anzeigen

source: label_slow_query_threshold
de: Grenzwert für langsame Abfragen

source: label_solr_settings
de: Einstellungen für die Solr Integration

# portal_type
source: Content type
de: Artikeltyp

source: Review state
de: Revisionsstatus
